tap "homebrew/bundle"
tap "homebrew/command-not-found", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-command-not-found.git"
tap "homebrew/services"
tap "jimeh/emacs-builds"
brew "xz"
brew "zstd"
brew "python@3.12"
brew "glib"
brew "autoconf"
brew "automake"
brew "bat"
brew "btop"
brew "bzip2"
brew "cmake"
brew "cmake-docs"
brew "coreutils"
brew "eva"
brew "eza"
brew "fd"
brew "fzf"
brew "gawk"
brew "git-delta"
brew "gnu-sed"
brew "gnutls"
brew "gnupg"
brew "harfbuzz"
brew "graphviz"
brew "grc"
brew "grep"
brew "openjdk"
brew "groovy"
brew "gtk+"
brew "htop"
brew "jd"
brew "jq"
brew "libpst"
brew "llvm"
brew "zlib"
brew "mysql@8.4"
brew "tree-sitter"
brew "neovim"
brew "node"
brew "pandoc"
brew "pipx"
brew "pkg-config"
brew "poppler"
brew "pyenv"
brew "pyright"
brew "python-brotli"
brew "rename"
brew "ripgrep"
brew "rust"
brew "sqlparse"
brew "telnet"
brew "tmux"
brew "tree"
brew "universal-ctags"
cask "dropshelf"
cask "emacs-app"
cask "font-cascadia-mono-nf"
cask "google-chrome"
cask "maccy"
